app/views/posts/_posts.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13)
---
<div class="comments">
    <% post.latest_comments.each do |comment| %>