app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
INSERT INTO "likes" ("created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-04-02 08:24:11.803078"], ["updated_at", "2022-04-02 08:24:11.803078"], ["author_id", 1], ["post_id", 13]]
---
  def create
    @post = Post.find(params[:post_id])
    @like = Like.new(author: current_user, post: @post)

    if @like.save