app/models/comment.rb

  def increment_comment_counter
    post.increment!(:comments_counter)
---
UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) + $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 4]]